// SPDX-License-Identifier: MIT
// Copyright © 2018-2021 WireGuard LLC. All Rights Reserved.
// Generic alert action names


"actionOK" = "OK";
"actionCancel" = "Peruuta";
"actionSave" = "Tallenna";

// Tunnels list UI

"tunnelsListTitle" = "WireGuard";
"tunnelsListSettingsButtonTitle" = "Asetukset";
"tunnelsListCenteredAddTunnelButtonTitle" = "Lisää tunneli";
"tunnelsListSwipeDeleteButtonTitle" = "Poista";
"tunnelsListSelectButtonTitle" = "Valitse";
"tunnelsListSelectAllButtonTitle" = "Valitse kaikki";
"tunnelsListDeleteButtonTitle" = "Poista";
"tunnelsListSelectedTitle (%d)" = "%d poistettu";

// Tunnels list menu

"addTunnelMenuHeader" = "Lisää uusi WireGuard tunneli";
"addTunnelMenuImportFile" = "Luo tiedostosta tai arkistosta";
"addTunnelMenuQRCode" = "Luo QR-koodista";
"addTunnelMenuFromScratch" = "Luo alusta";

// Tunnels list alerts

"alertImportedFromMultipleFilesTitle (%d)" = "Luotu %d tunnelia";
"alertImportedFromMultipleFilesMessage (%1$d of %2$d)" = "Luotu %1$d / %2$d tunnelia tuoduista tiedostoista";

"alertImportedFromZipTitle (%d)" = "Luotu %d tunnelia";
"alertImportedFromZipMessage (%1$d of %2$d)" = "Luotu %1$d / %2$d tunnelia zip-arkistosta";

"alertBadConfigImportTitle" = "Tunnelia ei voitu tuoda";
"alertBadConfigImportMessage (%@)" = "Tiedosto ”%@” ei sisällä kelvollista WireGuard konfiguraatiota";

"deleteTunnelsConfirmationAlertButtonTitle" = "Poista";
"deleteTunnelConfirmationAlertButtonMessage (%d)" = "Poista %d tunneli?";
"deleteTunnelsConfirmationAlertButtonMessage (%d)" = "Poista %d tunnelit?";

// Tunnel detail and edit UI

"newTunnelViewTitle" = "Uusi konfiguraatio";
"editTunnelViewTitle" = "Muokkaa konfiguraatiota";

"tunnelSectionTitleStatus" = "Tila";

"tunnelStatusInactive" = "Ei aktiivinen";
"tunnelStatusActivating" = "Aktivoidaan";
"tunnelStatusActive" = "Aktiivinen";
"tunnelStatusDeactivating" = "Deaktivoidaan";
"tunnelStatusReasserting" = "Aktivoidaan uudelleen";
"tunnelStatusRestarting" = "Käynnistetään uudelleen";
"tunnelStatusWaiting" = "Odotetaan";

"macToggleStatusButtonActivate" = "Aktivoi";
"macToggleStatusButtonActivating" = "Aktivoidaan…";
"macToggleStatusButtonDeactivate" = "Deaktivoi";
"macToggleStatusButtonDeactivating" = "Deaktivoidaan…";
"macToggleStatusButtonReasserting" = "Aktivoidaan uudelleen…";
"macToggleStatusButtonRestarting" = "Käynnistetään uudelleen…";
"macToggleStatusButtonWaiting" = "Odotetaan…";

"tunnelSectionTitleInterface" = "Liittymä";

"tunnelInterfaceName" = "Nimi";
"tunnelInterfacePrivateKey" = "Yksityinen avain";
"tunnelInterfacePublicKey" = "Julkinen avain";
"tunnelInterfaceGenerateKeypair" = "Luo avainpari";
"tunnelInterfaceAddresses" = "Osoitteet";
"tunnelInterfaceListenPort" = "Kuuntele porttia";
"tunnelInterfaceMTU" = "MTU";
"tunnelInterfaceDNS" = "DNS palvelimet";
"tunnelInterfaceStatus" = "Tila";

"tunnelSectionTitlePeer" = "Osapuoli";

"tunnelPeerPublicKey" = "Julkinen avain";
"tunnelPeerPreSharedKey" = "Jaettu avain";
"tunnelPeerEndpoint" = "Päätepiste";
"tunnelPeerPersistentKeepalive" = "Jatkuva keepalive";
"tunnelPeerAllowedIPs" = "Sallitut IP-osoitteet";
"tunnelPeerRxBytes" = "Data vastaanotettu";
"tunnelPeerTxBytes" = "Data lähetetty";
"tunnelPeerLastHandshakeTime" = "Viimeisin kättely";
"tunnelPeerExcludePrivateIPs" = "Jätä pois yksityiset IP-osoitteet";

"tunnelSectionTitleOnDemand" = "Automaattinen käyttöönotto";

"tunnelOnDemandCellular" = "Matkapuhelinverkko";
"tunnelOnDemandEthernet" = "Ethernet";
"tunnelOnDemandWiFi" = "Wi-Fi";
"tunnelOnDemandSSIDsKey" = "SSID:t";

"tunnelOnDemandAnySSID" = "Mikä tahansa SSID";
"tunnelOnDemandOnlyTheseSSIDs" = "Vain nämä SSID:t";
"tunnelOnDemandExceptTheseSSIDs" = "Poislukien SSID:t";
"tunnelOnDemandOnlySSID (%d)" = "Vain %d SSID";
"tunnelOnDemandOnlySSIDs (%d)" = "Vain %d SSID:t";
"tunnelOnDemandExceptSSID (%d)" = "Kaikki paitsi %d SSID";
"tunnelOnDemandExceptSSIDs (%d)" = "Kaikki paitsi %d SSID:t";
"tunnelOnDemandSSIDOptionDescriptionMac (%1$@: %2$@)" = "%1$@: %2$@";

"tunnelOnDemandSSIDViewTitle" = "SSID:t";
"tunnelOnDemandSectionTitleSelectedSSIDs" = "SSID:t";
"tunnelOnDemandNoSSIDs" = "Ei SSID-tietoja";
"tunnelOnDemandSectionTitleAddSSIDs" = "Lisää SSID-tietoja";
"tunnelOnDemandAddMessageAddConnectedSSID (%@)" = "Lisää yhdistetty: %@";
"tunnelOnDemandAddMessageAddNewSSID" = "Lisää uusi";

"tunnelOnDemandKey" = "Tarvittaessa";
"tunnelOnDemandOptionOff" = "Pois päältä";
"tunnelOnDemandOptionWiFiOnly" = "Vain Wi-Fi";
"tunnelOnDemandOptionWiFiOrCellular" = "Wi-Fi tai mobiiliverkko";
"tunnelOnDemandOptionCellularOnly" = "Vain mobiilidata";
"tunnelOnDemandOptionWiFiOrEthernet" = "Wi-Fi tai Ethernet";
"tunnelOnDemandOptionEthernetOnly" = "Vain Ethernet";

"addPeerButtonTitle" = "Lisää toinen osapuoli";

"deletePeerButtonTitle" = "Poista osapuoli";
"deletePeerConfirmationAlertButtonTitle" = "Poista";
"deletePeerConfirmationAlertMessage" = "Poistetaanko tämä osapuoli?";

"deleteTunnelButtonTitle" = "Poista tunneli";
"deleteTunnelConfirmationAlertButtonTitle" = "Poista";
"deleteTunnelConfirmationAlertMessage" = "Poistetaanko tämä tunneli?";

"tunnelEditPlaceholderTextRequired" = "Pakollinen";
"tunnelEditPlaceholderTextOptional" = "Valinnainen";
"tunnelEditPlaceholderTextAutomatic" = "Automaattinen";
"tunnelEditPlaceholderTextStronglyRecommended" = "Erittäin suositeltavaa";
"tunnelEditPlaceholderTextOff" = "Pois päältä";

"tunnelPeerPersistentKeepaliveValue (%@)" = "joka %@ sekuntin välein";
"tunnelHandshakeTimestampNow" = "Nyt";
"tunnelHandshakeTimestampSystemClockBackward" = "(Järjestelmän kello jättää)";
"tunnelHandshakeTimestampAgo (%@)" = "%@ sitten";
"tunnelHandshakeTimestampYear (%d)" = "%d vuosi";
"tunnelHandshakeTimestampYears (%d)" = "%d vuotta";
"tunnelHandshakeTimestampDay (%d)" = "%d päivä";
"tunnelHandshakeTimestampDays (%d)" = "%d päivää";
"tunnelHandshakeTimestampHour (%d)" = "%d tunti";
"tunnelHandshakeTimestampHours (%d)" = "%d tuntia";
"tunnelHandshakeTimestampMinute (%d)" = "%d minuutti";
"tunnelHandshakeTimestampMinutes (%d)" = "%d minuuttia";
"tunnelHandshakeTimestampSecond (%d)" = "%d sekunti";
"tunnelHandshakeTimestampSeconds (%d)" = "%d sekuntia";

"tunnelHandshakeTimestampHours hh:mm:ss (%@)" = "%@ tuntia";
"tunnelHandshakeTimestampMinutes mm:ss (%@)" = "%@ minuuttia";

"tunnelPeerPresharedKeyEnabled" = "käytössä";

// Error alerts while creating / editing a tunnel configuration
/* Alert title for error in the interface data */

"alertInvalidInterfaceTitle" = "Virheellinen liittymä";

/* Any one of the following alert messages can go with the above title */
"alertInvalidInterfaceMessageNameRequired" = "Sovittimen nimi vaadittu";
"alertInvalidInterfaceMessagePrivateKeyRequired" = "Sovittimen yksityinen avain on vaadittu";
"alertInvalidInterfaceMessagePrivateKeyInvalid" = "Sovittimen yksityinen avain on oltava 32-tavuinen avain base64 enkoodauksella";
"alertInvalidInterfaceMessageAddressInvalid" = "Sovittimen osoitteet on oltava pilkulla erotettujen IP-osoitteiden luettelo, valinnaisesti CIDR-notaatiossa";
"alertInvalidInterfaceMessageListenPortInvalid" = "Sovittimen kuunteluportin on tulee olla väliltä 0 - 65535, tai sen on oltava määrittelemätön";
"alertInvalidInterfaceMessageMTUInvalid" = "Sovittimen MTU on oltava väliltä 576 - 65535, tai sen on oltava määrittelemätön";
"alertInvalidInterfaceMessageDNSInvalid" = "Sovittimen DNS-palvelimien on oltava lista pilkulla erotettu IP-osoitteita";

/* Alert title for error in the peer data */
"alertInvalidPeerTitle" = "Virheellinen osapuoli";

/* Any one of the following alert messages can go with the above title */
"alertInvalidPeerMessagePublicKeyRequired" = "Osapuolen julkinen avain on vaadittu";
"alertInvalidPeerMessagePublicKeyInvalid" = "Osapuolen julkinen avain on oltava 32-tavuinen avain base64 -enkoodauksella";
"alertInvalidPeerMessagePreSharedKeyInvalid" = "Osapuolen jaettu avain on oltava 32-tavuinen avain base64 -enkoodauksella";
"alertInvalidPeerMessageAllowedIPsInvalid" = "Toisen osapuolen sallittujen IP-osoitteiden on oltava pilkulla erotettujen IP-osoitteiden luettelo, valinnaisesti CIDR-notaatiossa";
"alertInvalidPeerMessageEndpointInvalid" = "Käyttäjän päätepisteen on oltava muotoa ”host:port” tai ”[host]:port”";
"alertInvalidPeerMessagePersistentKeepaliveInvalid" = "Käyttäjän pysyvän keepalivin on oltava välillä 0–65535 tai määrittelemätön";
"alertInvalidPeerMessagePublicKeyDuplicated" = "Kahdella tai useammalla osapuolella ei voi olla samaa julkista avainta";

// Scanning QR code UI

"scanQRCodeViewTitle" = "Skannaa QR-koodi";
"scanQRCodeTipText" = "Vihje: Luo käyttämällä `qrencode -t ansiutf8 < tunnel.conf`";

// Scanning QR code alerts

"alertScanQRCodeCameraUnsupportedTitle" = "Kameraa ei tuettu";
"alertScanQRCodeCameraUnsupportedMessage" = "Tämä laite ei pysty skannaamaan QR-koodeja";

"alertScanQRCodeInvalidQRCodeTitle" = "Virheellinen QR-koodi";

"alertScanQRCodeUnreadableQRCodeTitle" = "Virheellinen koodi";

// Settings UI

"settingsViewTitle" = "Asetukset";

"settingsSectionTitleAbout" = "Tietoa";
"settingsVersionKeyWireGuardForIOS" = "WireGuard iOS:lle";
"settingsVersionKeyWireGuardGoBackend" = "WireGuard Go -moottori";

"settingsSectionTitleTunnelLog" = "Loki";
"settingsViewLogButtonTitle" = "Näytä loki";

// Log view

"logViewTitle" = "Loki";
"alertBadArchiveMessage" = "Huono tai korruptoitunut zip arkisto.";

"alertNoTunnelsToExportTitle" = "Ei mitään vietävää";
"alertNoTunnelsToExportMessage" = "Vietäviä tunneleita ei ole";

"alertNoTunnelsInImportedZipArchiveTitle" = "Zip arkistossa ei ole tunneleita";

// Tunnel management error alerts

"alertTunnelActivationFailureTitle" = "Aktivointi epäonnistui";

"alertTunnelNameEmptyTitle" = "Nimeä ei annettu lainkaan";

"alertTunnelAlreadyExistsWithThatNameTitle" = "Nimi on jo käytössä";

"alertTunnelActivationErrorTunnelIsNotInactiveTitle" = "Aktivointi käynnissä";

// Tunnel management error alerts on system error
/* The alert message that goes with the following titles would be
   one of the alertSystemErrorMessage* listed further down */

"alertSystemErrorOnListingTunnelsTitle" = "Tunneleita ei voitu listata";
"alertSystemErrorOnAddTunnelTitle" = "Tunnelia ei voitu luoda";

/* The alert message for this alert shall include
 one of the alertSystemErrorMessage* listed further down */
"alertTunnelActivationSystemErrorTitle" = "Aktivointi epäonnistui";

/* alertSystemErrorMessage* messages */
"alertSystemErrorMessageTunnelConfigurationInvalid" = "Konfiguraatio ei kelpaa.";
"alertSystemErrorMessageTunnelConnectionFailed" = "Yhteys epäonnistui.";
"alertSystemErrorMessageTunnelConfigurationReadWriteFailed" = "Konfiguraation lukeminen tai kirjoittaminen epäonnistui.";
"alertSystemErrorMessageTunnelConfigurationUnknown" = "Tuntematon järjestelmävirhe.";

// Mac status bar menu / pulldown menu / main menu

"macMenuNetworks (%@)" = "Verkot: %@";
"macMenuNetworksNone" = "Verkot: Ei mitään";

"macMenuTitle" = "WireGuard";
"macMenuManageTunnels" = "Hallitse tunneleita";
"macMenuImportTunnels" = "Tuo tunneli(t) tiedostosta…";
"macMenuAddEmptyTunnel" = "Lisää tyhjä tunneli…";
"macMenuViewLog" = "Näytä loki";
"macMenuExportTunnels" = "Vie tunnelit Zippinä…";
"macMenuAbout" = "Tietoa WireGuardista";
"macMenuQuit" = "Sulje WireGuard";

"macMenuHideApp" = "Piilota WireGuard";
"macMenuHideOtherApps" = "Piilota muut";
"macMenuShowAllApps" = "Näytä kaikki";

"macMenuFile" = "Tiedosto";
"macMenuCloseWindow" = "Sulje ikkuna";

"macMenuEdit" = "Muokkaa";
"macMenuCut" = "Leikkaa";
"macMenuCopy" = "Kopioi";
"macMenuPaste" = "Liitä";
"macMenuSelectAll" = "Valitse kaikki";

"macMenuTunnel" = "Tunneli";
"macMenuToggleStatus" = "Vaihda tilaa";
"macMenuEditTunnel" = "Muokkaa…";
"macMenuDeleteSelected" = "Poista valitut";

"macMenuWindow" = "Ikkuna";
"macMenuMinimize" = "Pienennä";
"macMenuZoom" = "Lähennä/Loitonna";

// Mac manage tunnels window

"macWindowTitleManageTunnels" = "Hallitse WireGuard tunneleita";

"macDeleteTunnelConfirmationAlertMessage (%@)" = "Oletko varma, että haluat poistaa \"%@\"?";
"macDeleteMultipleTunnelsConfirmationAlertMessage (%d)" = "Haluatko varmasti poistaa %d kohdetta?";
"macDeleteTunnelConfirmationAlertInfo" = "Tätä toimintoa ei voi peruuttaa.";
"macDeleteTunnelConfirmationAlertButtonTitleDelete" = "Poista";
"macDeleteTunnelConfirmationAlertButtonTitleCancel" = "Peruuta";
"macDeleteTunnelConfirmationAlertButtonTitleDeleting" = "Poistetaan…";

"macButtonImportTunnels" = "Tuo tunneli(t) tiedostosta";
"macSheetButtonImport" = "Tuo";

"macNameFieldExportLog" = "Tallenna loki kohteeseen:";
"macSheetButtonExportLog" = "Tallenna";

"macNameFieldExportZip" = "Vie tunnelit kohteeseen:";
"macSheetButtonExportZip" = "Tallenna";

"macButtonDeleteTunnels (%d)" = "Poista %d tunnelia";

"macButtonEdit" = "Muokkaa";
"macFieldOnDemand" = "Tarvittaessa:";
"macFieldOnDemandSSIDs" = "SSIDt:";

// Mac status display

"macStatus (%@)" = "Tila: %@";

// Mac editing config

"macEditDiscard" = "Hylkää";
"macEditSave" = "Tallenna";

"macAlertNameIsEmpty" = "Nimi on pakollinen";
"macAlertPrivateKeyInvalid" = "Yksityinen avain ei kelpaa.";
"macAlertListenPortInvalid (%@)" = "Portti \"%@\" ei kelpaa.";
"macAlertAddressInvalid (%@)" = "Osoite \"%@\" ei kelpaa.";
"macAlertDNSInvalid (%@)" = "DNS ‘%@’ ei kelpaa.";
"macAlertMTUInvalid (%@)" = "MTU ‘%@’ ei kelpaa.";

"macAlertPublicKeyInvalid" = "Julkinen avain ei kelpaa";
"macAlertPreSharedKeyInvalid" = "Jaettu avain ei kelpaa";
"macAlertAllowedIPInvalid (%@)" = "Sallitut IP-osoitteet %@\" eivät kelpaa";
"macAlertEndpointInvalid (%@)" = "Päätepiste \"%@\" ei kelpaa";
"macAlertPersistentKeepliveInvalid (%@)" = "Pysyvä keepalive arvo ‘%@’ ei kelpaa";

"macAlertUnrecognizedPeerKey (%@)" = "Osapuoli sisältää tunnistamattoman avaimen ”%@”";
"macAlertInfoUnrecognizedPeerKey" = "Voimassa olevat avaimet ovat: ”PublicKey”, ”PresharedKey”, ”AllowedIPs”, ”Endpoint” ja ”PersistentKeepalive”";

// Mac about dialog

"macAppVersion (%@)" = "Sovelluksen versio: %@";
"macGoBackendVersion (%@)" = "Go -moottorin versio: %@";
"iosViewPrivateData" = "Todenna nähdäksesi tunnelin yksityiset avaimet.";
"macConfirmAndQuitAlertQuitWireGuard" = "Sulje WireGuard";
"macConfirmAndQuitAlertCloseWindow" = "Sulje tunneleiden hallinta";

// Mac tooltip

"macToolTipEditTunnel" = "Muokkaa tunnelia (⌘E)";

// Mac log view

"macLogColumnTitleTime" = "Aika";
"macLogColumnTitleLogMessage" = "Lokiviesti";
"macLogButtonTitleClose" = "Sulje";
"macLogButtonTitleSave" = "Tallenna…";
"macUnusableTunnelButtonTitleDeleteTunnel" = "Poista tunneli";

// Mac App Store updating alert

"macAppStoreUpdatingAlertMessage" = "App Store haluaa päivittää WireGuardin";

// Donation

"donateLink" = "♥ Lahjoita WireGuard projektille";
"macAlertNoInterface" = "Configuration must have an ‘Interface’ section.";
"macConfirmAndQuitAlertInfo" = "If you close the tunnels manager, WireGuard will continue to be available from the menu bar icon.";
"macUnusableTunnelInfo" = "In case this tunnel was created by another user, only that user can view, edit, or activate this tunnel.";
"alertTunnelActivationErrorTunnelIsNotInactiveMessage" = "The tunnel is already active or in the process of being activated";
"alertTunnelActivationSetNetworkSettingsMessage" = "Unable to apply network settings to tunnel object.";
"alertCantOpenInputConfFileTitle" = "Unable to import from file";
"alertScanQRCodeInvalidQRCodeMessage" = "The scanned QR code is not a valid WireGuard configuration";
"macConfirmAndQuitAlertMessage" = "Do you want to close the tunnels manager or quit WireGuard entirely?";
"alertTunnelActivationSavedConfigFailureMessage" = "Unable to retrieve tunnel information from the saved configuration.";
"macAlertInfoUnrecognizedInterfaceKey" = "Valid keys are: ‘PrivateKey’, ‘ListenPort’, ‘Address’, ‘DNS’ and ‘MTU’.";
"alertTunnelNameEmptyMessage" = "Cannot create tunnel with an empty name";
"alertUnableToWriteLogMessage" = "Unable to write logs to file";
"settingsExportZipButtonTitle" = "Export zip archive";
"macViewPrivateData" = "view tunnel private keys";
"macAppExitingWithActiveTunnelInfo" = "The tunnel will remain active after exiting. You may disable it by reopening this application or through the Network panel in System Preferences.";
"alertUnableToRemovePreviousLogTitle" = "Log export failed";
"alertTunnelActivationFailureMessage" = "The tunnel could not be activated. Please ensure that you are connected to the Internet.";
"alertCantOpenInputZipFileMessage" = "The zip archive could not be read.";
"alertSystemErrorMessageTunnelConfigurationDisabled" = "The configuration is disabled.";
"alertUnableToWriteLogTitle" = "Log export failed";
"alertCantOpenOutputZipFileForWritingMessage" = "Could not open zip file for writing.";
"alertSystemErrorOnRemoveTunnelTitle" = "Unable to remove tunnel";
"alertSystemErrorOnModifyTunnelTitle" = "Unable to modify tunnel";
"macAppExitingWithActiveTunnelMessage" = "WireGuard is exiting with an active tunnel";
"alertSystemErrorMessageTunnelConfigurationStale" = "The configuration is stale.";
"alertTunnelDNSFailureMessage" = "One or more endpoint domains could not be resolved.";
"alertTunnelDNSFailureTitle" = "DNS resolution failure";
"alertCantOpenInputZipFileTitle" = "Unable to read zip archive";
"alertScanQRCodeUnreadableQRCodeMessage" = "The scanned code could not be read";
"macAlertMultipleInterfaces" = "Configuration must have only one ‘Interface’ section.";
"macUnusableTunnelMessage" = "The configuration for this tunnel cannot be found in the keychain.";
"alertBadArchiveTitle" = "Unable to read zip archive";
"macExportPrivateData" = "export tunnel private keys";
"macToolTipToggleStatus" = "Toggle status (⌘T)";
"macTunnelsMenuTitle" = "Tunnels";
"alertTunnelAlreadyExistsWithThatNameMessage" = "A tunnel with that name already exists";
"iosExportPrivateData" = "Authenticate to export tunnel private keys.";
"alertScanQRCodeNamePromptTitle" = "Please name the scanned tunnel";
"alertUnableToRemovePreviousLogMessage" = "The pre-existing log could not be cleared";
"alertTunnelActivationBackendFailureMessage" = "Unable to turn on Go backend library.";
"settingsSectionTitleExportConfigurations" = "Export configurations";
"alertCantOpenOutputZipFileForWritingTitle" = "Unable to create zip archive";
"alertNoTunnelsInImportedZipArchiveMessage" = "No .conf tunnel files were found inside the zip archive.";
"alertTunnelActivationFileDescriptorFailureMessage" = "Unable to determine TUN device file descriptor.";
